{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 424, 424, 4], "padding": "same", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_size": [7, 7], "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "axis": -1, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true}}, {"class_name": "Conv2D", "config": {"batch_input_shape": [null, 424, 424, 4], "padding": "same", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "axis": -1, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv2d_6", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last"}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "pool_size": [4, 4], "padding": "valid", "name": "average_pooling2d_1", "trainable": true, "strides": [4, 4]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "axis": -1, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "units": 320, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "trainable": true, "units": 320, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [8, 8, 5]}}]}